Use [ШустПродажи]
SELECT Товары.Наименование, Заказы.Дата_поставки
FROM Заказчики INNER JOIN 
		Заказы ON Заказчики.Наименование_фирмы = Заказы.Заказчик INNER JOIN 
		Товары ON Заказы.Наименование_товара = Товары.Наименование
WHERE (Заказы.Дата_поставки > CONVERT(datetime, '2021-02-05', 102))

Select Товары.Наименование, Товары.Цена 
From Товары 
Where (Товары.Цена > 300 And Товары.Цена < 700)

Select Заказчики.Наименование_фирмы, Товары.Наименование
From Заказчики Inner join 
Заказы On Заказчики.Наименование_фирмы = Заказы.Заказчик Inner join
Товары On Заказы.Наименование_товара = Товары.Наименование
Where (Товары.Наименование = N'Стол')

Select Заказы.Заказчик, Заказы.Дата_поставки, Заказы.Наименование_товара, Заказы.Количество
From Заказчики Inner join 
Заказы On Заказчики.Наименование_фирмы = Заказы.Заказчик
Where (Заказчики.Наименование_фирмы = N'ГродноАзот')
Order By Заказы.Дата_поставки